[{
        "bookId": 1,
        "bookName": "The Great Gatsby",
        "author": "F. Scott Fitzgerald",
        "image": "../src/assets/images/The Great Gatsby.jpg",
        "review": "A classic novel that explores themes of decadence, idealism, and resistance to change. Set in the Jazz Age, it tells the story of Jay Gatsby and his unrequited love for Daisy Buchanan. The novel is renowned for its critique of the American Dream and its rich symbolism.",
        "totalPages": 218,
        "rating": 4.5,
        "category": "Fiction",
        "tags": ["Classic", "American Literature"],
        "publisher": "Charles Scribner's Sons",
        "yearOfPublishing": 1925
    },
    {
        "bookId": 2,
        "bookName": "To Kill a Mockingbird",
        "author": "Harper Lee",
        "image": "../src/assets/images/To Kill a Mockingbird.jpg",
        "review": "A powerful novel about racial injustice and the loss of innocence. Set in the Deep South during the 1930s, it follows young Scout Finch and her brother, Jem, as their father, Atticus, defends a black man wrongly accused of raping a white woman. The novel addresses serious issues with warmth and humor.",
        "totalPages": 281,
        "rating": 4.8,
        "category": "Fiction",
        "tags": ["Classic", "Legal"],
        "publisher": "J.B. Lippincott & Co.",
        "yearOfPublishing": 1960
    },
    {
        "bookId": 3,
        "bookName": "1984",
        "author": "George Orwell",
        "image": "../src/assets/images/George Orwell.jpg",
        "review": "A dystopian novel that delves into the dangers of totalitarianism. It is set in a world of perpetual war, pervasive government surveillance, and incessant public mind control. The protagonist, Winston Smith, struggles to maintain his individuality and sanity in a society that demands absolute conformity.",
        "totalPages": 328,
        "rating": 4.6,
        "category": "Fiction",
        "tags": ["Dystopian", "Political"],
        "publisher": "Secker & Warburg",
        "yearOfPublishing": 1949
    },
    {
        "bookId": 4,
        "bookName": "Pride and Prejudice",
        "author": "Jane Austen",
        "image": "../src/assets/images/Pride and Prejudice.jpg",
        "review": "A romantic novel that also critiques the British landed gentry. It tells the story of Elizabeth Bennet and her romantic entanglements, particularly with the proud Mr. Darcy. Through its intricate characterizations and biting social commentary, the novel explores themes of class, marriage, and morality.",
        "totalPages": 279,
        "rating": 4.7,
        "category": "Fiction",
        "tags": ["Romance", "Classic"],
        "publisher": "T. Egerton",
        "yearOfPublishing": 1813
    },
    {
        "bookId": 5,
        "bookName": "The Catcher in the Rye",
        "author": "J.D. Salinger",
        "image": "../src/assets/images/The Catcher in the Rye.jpg",
        "review": "A novel about teenage angst and alienation. It follows the experiences of 16-year-old Holden Caulfield in New York City after being expelled from prep school. The novel captures Holden's struggles with growing up, his disdain for adult hypocrisy, and his desire to protect the innocence of childhood.",
        "totalPages": 234,
        "rating": 4.3,
        "category": "Fiction",
        "tags": ["Coming of Age", "Classic"],
        "publisher": "Little, Brown and Company",
        "yearOfPublishing": 1951
    },
    {
        "bookId": 6,
        "bookName": "The Hobbit",
        "author": "J.R.R. Tolkien",
        "image": "../src/assets/images/The Hobbit.jpg",
        "review": "A fantasy novel that serves as a prelude to The Lord of the Rings. It follows the journey of Bilbo Baggins, a hobbit who is thrust into an epic adventure to reclaim a treasure guarded by the dragon Smaug. The novel is celebrated for its richly imagined world and timeless themes of bravery and friendship.",
        "totalPages": 310,
        "rating": 4.8,
        "category": "Fantasy",
        "tags": ["Adventure", "Fantasy"],
        "publisher": "George Allen & Unwin",
        "yearOfPublishing": 1937
    },
    {
        "bookId": 7,
        "bookName": "Moby Dick",
        "author": "Herman Melville",
        "image": "../src/assets/images/Moby Dick.jpg",
        "review": "A novel about the obsessive quest of Captain Ahab to capture the white whale, Moby Dick. Narrated by Ishmael, the story delves into themes of obsession, revenge, and the struggle against nature. The novel is known for its complex symbolism, detailed descriptions of whaling, and profound philosophical insights.",
        "totalPages": 635,
        "rating": 4.4,
        "category": "Fiction",
        "tags": ["Adventure", "Classic"],
        "publisher": "Harper & Brothers",
        "yearOfPublishing": 1851
    },
    {
        "bookId": 8,
        "bookName": "War and Peace",
        "author": "Leo Tolstoy",
        "image": "../src/assets/images/War and Peace.jpg",
        "review": "A novel that chronicles the history of the French invasion of Russia and the impact of the Napoleonic era on Tsarist society. The book intertwines the lives of several families, providing a panoramic view of Russian society. It explores themes of war, peace, love, and the complexities of human nature.",
        "totalPages": 1225,
        "rating": 4.7,
        "category": "Historical Fiction",
        "tags": ["Classic", "War"],
        "publisher": "The Russian Messenger",
        "yearOfPublishing": 1869
    },
    {
        "bookId": 9,
        "bookName": "The Alchemist",
        "author": "Paulo Coelho",
        "image": "../src/assets/images/The Alchemist.jpg",
        "review": "A philosophical book about following one's dreams and listening to one's heart. It tells the story of Santiago, a shepherd boy who travels from Spain to the Egyptian desert in search of a treasure. The novel is celebrated for its inspirational message, enchanting narrative, and exploration of personal legend.",
        "totalPages": 208,
        "rating": 4.6,
        "category": "Fiction",
        "tags": ["Philosophical", "Adventure"],
        "publisher": "HarperOne",
        "yearOfPublishing": 1988
    }
]